chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
#include "main.h"
#include "communicate_protocol.h"
#include "gd32f3x0.h"
#include "math.h"
#include "hard_i2c.h"
#include "stdio.h"
#include "string.h"
#include "systick.h"
#include <stdint.h>

#define delay_ms(x) delay_1ms(x)

/************************ 宏定义区域 ************************/
// I2C设备7位地址
#define ICM42670_ADDR 0x68
#define QMC5883P_ADDR 0x2c

#define I2C_IMU I2C1       // ICM42670挂载I2C1 (PA0/PA1)
#define I2C_MAG I2C1       // 磁力计挂载I2C1
#define USART_RS485 USART1 // RS485上报串口
#define I2C_TIMEOUT 10000U // I2C通信超时计数（与hard_i2c.h保持一致）

// 采样与报警配置
#define DT 0.01f                  // 10ms采样周期 100Hz
#define MAG_DISTURB_THRESH 120.0f // 地磁突变判定阈值

/************************ 全局数据结构体 ************************/

// 全局变量
icm_raw_data_t icm_raw;
mag_raw_data_t mag_raw;
attitude_info_t att;
gyro_bias_t gyro_bias;
quaternion_t quat;

uint8_t day_mode = 1;                 // 1=白天6轴模式 0=夜间9轴融合
uint8_t mag_disturb_flag = 0;         // 地磁受大车干扰标记
uint8_t fault_type = 0;               // 偏转报警类型标记
static uint16_t alarm_filter_cnt = 0; // 报警防抖计数器
uint32_t stable_cnt;
volatile uint8_t imu_loop_flag = 0; // 定时器中断标志

#define ARRAYNUM(arr_nanme) (uint32_t)(sizeof(arr_nanme) / sizeof(*(arr_nanme)))
#define TRANSMIT_SIZE (ARRAYNUM(transmitter_buffer) - 1)

uint8_t transmitter_buffer[128] = "\n\rUSART interrupt test\n\r";
uint8_t receiver_buffer[32];
uint8_t transfersize = TRANSMIT_SIZE;
uint8_t receivesize = 32;
__IO uint8_t txcount = 0;
__IO uint16_t rxcount = 0;

/************************ USART0 DMA + 空闲中断接收 ************************/
#define USART0_RX_BUF_SIZE 256U
uint8_t usart0_rx_buffer[USART0_RX_BUF_SIZE];
volatile uint16_t usart0_rx_len = 0;
volatile uint8_t usart0_rx_flag = 0;

/************************ ICM42670 驱动函数 ************************/
/* 软I2C助手函数前向声明（定义在文件后部，供icm42670_init提前调用） */
static void diag_scl(uint8_t level);
static void diag_sda(uint8_t level);
static uint8_t diag_sda_in(void);
static void diag_start(void);
static void diag_stop(void);
static uint8_t diag_send_byte(uint8_t byte);
// static uint8_t diag_read_byte(uint8_t ack_bit);  /* 诊断用，已注释 */
static void diag_reg_write(uint8_t dev, uint8_t reg, uint8_t data);
/**
 * @brief ICM42670芯片初始化
 * @note 硬件I2C对0x75(WHO_AM_I)读会时钟拉伸挂起（软I2C诊断已确认器件正常，ID=0x67），
 *       故此处改用软I2C写配置寄存器，配完后恢复硬件I2C引脚供主循环读数据。
 */
void icm42670_init(void) {
  printf("ICM42670 init: via soft-I2C ...\r\n");

  /* 切换到软I2C（GPIO开漏）模式 */
  gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_0 | GPIO_PIN_1);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_0 | GPIO_PIN_1);
  diag_scl(1); diag_sda(1);
  delay_1ms(2);

  diag_reg_write(0x68, 0x1F, 0x00);
  delay_ms(100);

  diag_reg_write(0x68, 0x1F, 0x0F);
  delay_ms(30);

  diag_reg_write(0x68, 0x21, 0x68);
  diag_reg_write(0x68, 0x20, 0x68);

  /* 恢复硬件I2C引脚(AF4)，供主循环/后续硬件I2C使用 */
  gpio_af_set(GPIOA, GPIO_AF_4, GPIO_PIN_0);
  gpio_af_set(GPIOA, GPIO_AF_4, GPIO_PIN_1);
  gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_0 | GPIO_PIN_1);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_0 | GPIO_PIN_1);

  printf("ICM42670 init done\r\n");
}

/**
 * @brief 读取IMU全部原始数据并转换物理量
 */
void icm42670_get_raw_data(void) {
  uint8_t buf[12] = {0};
  i2c_reg_read_multi(I2C_IMU, ICM42670_ADDR, 0x0B, buf, 12);

  int16_t ax_raw = (buf[0] << 8) | buf[1];
  int16_t ay_raw = (buf[2] << 8) | buf[3];
  int16_t az_raw = (buf[4] << 8) | buf[5];
  icm_raw.ax = ax_raw / 16384.0f;
  icm_raw.ay = ay_raw / 16384.0f;
  icm_raw.az = az_raw / 16384.0f;

  int16_t gx_raw = (buf[6] << 8) | buf[7];
  int16_t gy_raw = (buf[8] << 8) | buf[9];
  int16_t gz_raw = (buf[10] << 8) | buf[11];
  icm_raw.gx = gx_raw / 131.072f;
  icm_raw.gy = gy_raw / 131.072f;
  icm_raw.gz = gz_raw / 131.072f;

  uint8_t temp_buf[2] = {0};
  i2c_reg_read_multi(I2C_IMU, ICM42670_ADDR, 0x09, temp_buf, 2);
  int16_t temp_raw = (temp_buf[0] << 8) | temp_buf[1];
  icm_raw.temp = temp_raw / 132.48f + 25.0f;
}

/************************ 磁力计驱动 ************************/
void qmc5883p_init(void) {
  /* Step 1: 软复位 Control(0x0B) bit7=1 */
  i2c_reg_write(I2C_MAG, QMC5883P_ADDR, 0x0B, 0x80);
  delay_ms(100);

  /* Step 2: 退出复位 */
  i2c_reg_write(I2C_MAG, QMC5883P_ADDR, 0x0B, 0x00);
  delay_ms(100);

  /* Step 3: 读 Chip ID 校验 (0x00 = 0x80) */
  uint8_t id = i2c_reg_read(I2C_MAG, QMC5883P_ADDR, 0x00);
  if (id != 0x80) {
    printf("QMC5883P not detected, ID=0x%02X\r\n", id);
  } else {
    printf("got id: 0x%02X\r\n", id);
  }

  /* Step 4: 配置 Control(0x0B) bits3-2=10(±8G), set_and_reset_on
     0x0C = 0b00001100 */
  i2c_reg_write(I2C_MAG, QMC5883P_ADDR, 0x0B, 0x0C);
  delay_ms(10);
  /* Step 5: 配置 Control Register 1 (0x0A): 连续模式 + 200Hz + OSR1=8 + OSR2=2
     0x4F = 0b01001111 */
  i2c_reg_write(I2C_MAG, QMC5883P_ADDR, 0x0A, 0x4F);
  delay_ms(10);
}

/**
 * @brief 读取磁力计原始数据（LSB first），计算地磁模长
 * @note  ±8G 量程下 1LSB = 1/2048 G
 * @note  寄存器 0x00=ChipID, 0x01~0x06=数据, 从 0x01 开始读
 */
void qmc5883p_get_raw_data(void) {
  uint8_t buf[6] = {0};
  i2c_reg_read_multi(I2C_MAG, QMC5883P_ADDR, 0x01, buf, 6);

  /* QMC5883P 小端序: X_L, X_H, Y_L, Y_H, Z_L, Z_H */
  int16_t mx_raw = (buf[1] << 8) | buf[0];
  int16_t my_raw = (buf[3] << 8) | buf[2];
  int16_t mz_raw = (buf[5] << 8) | buf[4];

  mag_raw.mx = mx_raw / 2048.0f; /* 转换为高斯 */
  mag_raw.my = my_raw / 2048.0f;
  mag_raw.mz = mz_raw / 2048.0f;
  mag_raw.mag_norm = sqrtf(mag_raw.mx * mag_raw.mx + mag_raw.my * mag_raw.my +
                           mag_raw.mz * mag_raw.mz);
}

/**
 * @brief 判断地磁是否被大车金属干扰
 */
void mag_disturb_detect(void) {
  static float last_norm = 0;
  float delta = fabsf(mag_raw.mag_norm - last_norm);
  last_norm = mag_raw.mag_norm;
  mag_disturb_flag = (delta > MAG_DISTURB_THRESH) ? 1 : 0;
}

/************************ 陀螺静态零偏自动校准 ************************/
/**
 * @brief 设备静止时自动微调Z轴陀螺零偏，抑制温度漂移
 * 仅保存至内存，不写入Flash，上电重置
 */

/************************ 四元数辅助函数 ************************/
static void quat_normalize(void) {
  float norm = sqrtf(quat.w * quat.w + quat.x * quat.x + quat.y * quat.y +
                     quat.z * quat.z);
  if (norm > 0.0001f) {
    quat.w /= norm;
    quat.x /= norm;
    quat.y /= norm;
    quat.z /= norm;
  }
}

static void euler_to_quat(float pitch_deg, float roll_deg, float yaw_deg) {
  float p = pitch_deg * 0.0174533f * 0.5f;
  float r = roll_deg * 0.0174533f * 0.5f;
  float y = yaw_deg * 0.0174533f * 0.5f;

