chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
  float cp = cosf(p), sp = sinf(p);
  float cr = cosf(r), sr = sinf(r);
  float cy = cosf(y), sy = sinf(y);

  quat.w = cp * cr * cy + sp * sr * sy;
  quat.x = sp * cr * cy - cp * sr * sy;
  quat.y = cp * sr * cy + sp * cr * sy;
  quat.z = cp * cr * sy - sp * sr * cy;

  quat_normalize();
}

/************************ 姿态解算算法 ************************/
/**
 * @brief 姿态解算（四元数版）
 * 内部使用四元数进行姿态更新，避免万向节锁
 * 输出仍然是欧拉角（pitch, roll, yaw_now）
 */
void attitude_calc_6axis(float ax, float ay, float az, float gx, float gy,
                         float gz, float temp) {
  // ====== 阶段0：静态变量（跨调用保持状态） ======
  static uint8_t first_run = 1; // 首次运行标志，触发初始对准
  static float gx_bias = 0.0f, gy_bias = 0.0f; // 陀螺零偏估计值（在线校准）
  static float gx_sum = 0.0f, gy_sum = 0.0f, gz_sum = 0.0f; // 初始对准累加器
  static uint16_t init_cnt = 0;                 // 初始对准采样计数
  static float ix = 0.0f, iy = 0.0f, iz = 0.0f; // Mahony PI 控制器积分项

  // ====== 阶段1：初始对准（前100次采样，约1秒） ======
  if (first_run) {
    gx_sum += gx;
    gy_sum += gy;
    gz_sum += gz;
    init_cnt++;

    if (init_cnt >= 500) {
      // 100次采样完成，求均值作为陀螺静态零偏
      gx_bias = gx_sum / 500.0f;
      gy_bias = gy_sum / 500.0f;
      gyro_bias.gz_bias = gz_sum / 500.0f;
      gyro_bias.temp_ref = temp;

      // 用加速度计计算初始姿态角，初始化四元数（yaw=0）
      float accel_pitch = atan2f(-ax, sqrtf(ay * ay + az * az)) * 57.3f;
      float accel_roll = atan2f(ay, az) * 57.3f;
      euler_to_quat(accel_pitch, accel_roll, att.yaw_now);

      first_run = 0;
    } else {
      // 初始化未完成，仅输出加速度计姿态，不积分
      float accel_pitch = atan2f(-ax, sqrtf(ay * ay + az * az)) * 57.3f;
      float accel_roll = atan2f(ay, az) * 57.3f;
      att.pitch = accel_pitch;
      att.roll = accel_roll;
      att.yaw_now = att.yaw_now;
      return;
    }
  }

  // ====== 阶段2：陀螺零偏补偿 ======
  float gx_comp = gx - gx_bias;
  float gy_comp = gy - gy_bias;
  float gz_comp = gz - gyro_bias.gz_bias;
  // ====== 阶段3：静止检测 ======
  static uint16_t stable_cnt = 0;                 // 连续静止采样计数
  uint8_t is_stable = (fabsf(gx_comp) < 0.6f) && // 三轴角速度均 < 2°/s
                      (fabsf(gy_comp) < 0.6f) && // 判定为静止状态
                      (fabsf(gz_comp) < 0.6f);
  // printf("stable_cnt=%d, is_stable=%d, gx_comp=%.2f, gy_comp=%.2f,
  // gz_comp=%.2f\r\n", stable_cnt, is_stable, gx_comp, gy_comp, gz_comp);
  if (is_stable) {
    stable_cnt++;
  } else {
    stable_cnt = 0;
    // 运动时清零 Mahony 积分项，防止积分饱和
    ix = 0.0f;
    iy = 0.0f;
    iz = 0.0f;
  }

  // ====== 阶段4：陀螺积分 → 四元数增量（一阶龙格库塔法） ======
  float q0 = quat.w, q1 = quat.x, q2 = quat.y, q3 = quat.z;

  float gx_rad = gx_comp * 0.0174533f; // °/s → rad/s
  float gy_rad = gy_comp * 0.0174533f;
  float gz_rad = gz_comp * 0.0174533f;

  float half_dt = DT * 0.5f; // 半采样周期

  // 四元数微分方程: dq/dt = 0.5 * q ⊗ ω
  float dq0 = (-q1 * gx_rad - q2 * gy_rad - q3 * gz_rad) * half_dt;
  float dq1 = (q0 * gx_rad + q2 * gz_rad - q3 * gy_rad) * half_dt;
  float dq2 = (q0 * gy_rad - q1 * gz_rad + q3 * gx_rad) * half_dt;
  float dq3 = (q0 * gz_rad + q1 * gy_rad - q2 * gx_rad) * half_dt;

  // ====== 阶段5：加速度计 Mahony 互补滤波修正（仅修正 pitch/roll） ======
  float acc_norm = sqrtf(ax * ax + ay * ay + az * az);
  // 条件：连续静止 > 100ms 且加速度模长接近 1g（排除剧烈运动干扰）
  if (stable_cnt > 10 && acc_norm > 0.9f && acc_norm < 1.1f) {
    float ax_n = ax / acc_norm; // 归一化加速度
    float ay_n = ay / acc_norm;
    float az_n = az / acc_norm;

    // 从当前四元数提取重力方向在机体坐标系下的投影（理论值）
    float vx = 2.0f * (q1 * q3 - q0 * q2);
    float vy = 2.0f * (q0 * q1 + q2 * q3);
    float vz = q0 * q0 - q1 * q1 - q2 * q2 + q3 * q3;

    // 叉积求姿态误差：加速度实测值 × 四元数估计值
    float ex = ay_n * vz - az_n * vy;
    float ey = az_n * vx - ax_n * vz;
    float ez = ax_n * vy - ay_n * vx;

    // PI 控制器：比例项快速收敛 + 积分项消除稳态误差
    const float Kp = 25.0f; // 比例增益 0.5
    const float Ki = 0.3f;   // 积分增益 0.001
    ix += ex * Ki;
    iy += ey * Ki;
    iz += ez * Ki;

    // printf(" ez = %.4f, iz = %.4f, yaw=%.5f, gz_bias=%.5f\r\n", ez, iz, att.yaw_now, gyro_bias.gz_bias);

    // 将修正量叠加到四元数增量（d3 修正 pitch/roll，不修正 yaw）
    dq1 += (ex * Kp + ix) * half_dt;
    dq2 += (ey * Kp + iy) * half_dt;
    dq3 += (ez * Kp + iz) * half_dt;
  }

  // ====== 阶段6：更新四元数并归一化 ======
  quat.w += dq0;
  quat.x += dq1;
  quat.y += dq2;
  quat.z += dq3;

  quat_normalize();

  // ====== 阶段8：四元数 → 欧拉角输出 ======
  q0 = quat.w;
  q1 = quat.x;
  q2 = quat.y;
  q3 = quat.z;

  // 重力方向在机体坐标系下的投影
  float vx = 2.0f * (q1 * q3 - q0 * q2);
  float vy = 2.0f * (q0 * q1 + q2 * q3);
  float vz = q0 * q0 - q1 * q1 - q2 * q2 + q3 * q3;

  att.pitch = -atan2f(-vx, sqrtf(vy * vy + vz * vz)) * 57.3f;
  att.roll = -atan2f(vy, vz) * 57.3f;

  // ====== 阶段7：长时间静止时在线校准陀螺零偏 ======
  if (stable_cnt > 200) {
    // 指数滑动平均跟踪零偏漂移，时间常数 τ ≈ 10s

    gx_bias = gx_bias * 0.99f + gx * 0.01f;
    gy_bias = gy_bias * 0.99f + gy * 0.01f;
    gyro_bias.gz_bias = gyro_bias.gz_bias * 0.99f + gz * 0.01f;
    // }

  } else {
    // 航向角纯陀螺积分（6轴模式无磁力计修正）
    att.yaw_now += gz_comp * DT;
  }
  // att.yaw_now += gz_comp * DT;
  // printf("is_stable=%d, yaw=%.5f, gz_bias=%.5f\r\n", is_stable, att.yaw_now,
  //        gyro_bias.gz_bias);
  // 角度归一化到 [-180°, 180°]
  while (att.yaw_now > 180.0f) {
    att.yaw_now -= 360.0f;
  }

  while (att.yaw_now < -180.0f) {
    att.yaw_now += 360.0f;
  }
}

/**
 * @brief 夜间9轴融合解算（无大车干扰，地磁缓慢修正Yaw积分漂移）
 */
void attitude_calc_9axis(void) {
  attitude_calc_6axis(-icm_raw.az, icm_raw.ay, icm_raw.ax, -icm_raw.gz,
                      icm_raw.gy, icm_raw.gx, icm_raw.temp);

  // 磁力计修正：仅在夜间模式、静止且无地磁干扰时执行
  if (day_mode == 0 && mag_disturb_flag == 0) {
    float pitch_rad = att.pitch * 0.0174533f;
    float cos_p = cosf(pitch_rad);

    if (fabsf(cos_p) > 0.15f) {
      float roll_rad = att.roll * 0.0174533f;
      float sin_p = sinf(pitch_rad);
      float cos_r = cosf(roll_rad);
      float sin_r = sinf(roll_rad);

      float mx_h = mag_raw.mx * cos_p + mag_raw.mz * sin_p;
      float my_h = mag_raw.mx * sin_r * sin_p + mag_raw.my * cos_r -
                   mag_raw.mz * sin_r * cos_p;

      float mag_yaw = atan2f(my_h, mx_h) * 57.3f;
      float yaw_err = mag_yaw - att.yaw_now;
      if (yaw_err > 180.0f)
        yaw_err -= 360.0f;
      if (yaw_err < -180.0f)
        yaw_err += 360.0f;

      att.yaw_now += yaw_err * 0.01f;
    }
  }
}

/************************ RS485串口上报函数 ************************/
/**
 * @brief 串口发送字符串
 */
void usart_send_string(char *str) {
  uint16_t len = strlen(str);
  for (uint16_t i = 0; i < len; i++) {
    while (usart_flag_get(USART_RS485, USART_FLAG_TBE) == RESET)
      ;
    usart_data_transmit(USART_RS485, str[i]);
  }
  while (usart_flag_get(USART_RS485, USART_FLAG_TC) == RESET)
    ;
}

/**
 * @brief 发送报警信息
 * @param fault_type:0x01倾斜故障 0x02旋转故障 0x03同时故障
 */
void send_alarm_info(uint8_t fault_type, float pit, float rol, float yaw) {
  static uint16_t alarm_print_cnt = 0;
  alarm_print_cnt++;
  if (alarm_print_cnt >= 100) {
    char buf[64] = {0};
    // sprintf(buf, "FAULT:%d,P=%.1f,R=%.1f,Y=%.1f\r\n", fault_type, pit, rol,
    //         yaw);
    // printf("%s", buf);
    alarm_print_cnt = 0;
  }
}

/************************ 昼夜模式切换（RTC小时判定） ************************/
void update_day_night_mode(uint8_t rtc_hour) {
  // 6点~22点白天6轴模式，其余夜间9轴融合
  if (rtc_hour >= 6 && rtc_hour < 22)
    day_mode = 1;
  else
    day_mode = 0;
}

/************************ 主循环调度函数（10ms定时调用）
 * ************************/
/**
 * @brief 定时10ms执行一次，传入RTC当前小时
 */
void imu_main_loop(uint8_t rtc_hour) {
  // 更新昼夜工作模式
  // printf("main loop\n");
  // usart_interrupt_enable(USART0, USART_INT_TBE);
  update_day_night_mode(rtc_hour);

  // 采集传感器原始数据
  icm42670_get_raw_data();
  qmc5883p_get_raw_data();
  static int16_t loop_cnt = 0;
  loop_cnt++;
  if (loop_cnt % 10 == 0) {
    // 检测前后地磁向量模长，参数值判断磁场是否被干扰
    mag_disturb_detect();
  } else {
    loop_cnt = 0;
  }

  // 分时姿态解算
  //   if (day_mode == 1)
  attitude_calc_6axis(-icm_raw.az, icm_raw.ay, icm_raw.ax, -icm_raw.gz,
                      icm_raw.gy, icm_raw.gx, icm_raw.temp);
  //   else
  //   attitude_calc_9axis();

